[Killed] Arithmetic mutation
JsonParser.cs:22:34
     {
         int arrayOffset = 0;
         int stringCounter = 0;
-        bool isInsideString() => stringCounter % 2 == 1;
+        bool isInsideString() => stringCounter * 2  == 1;
         bool isEndOfValue = false;
         bool isAdvancedNumber = false;

[Killed] Equality mutation
JsonParser.cs:22:34
     {
         int arrayOffset = 0;
         int stringCounter = 0;
-        bool isInsideString() => stringCounter % 2 == 1;
+        bool isInsideString() => stringCounter % 2 != 1;
         bool isEndOfValue = false;
         bool isAdvancedNumber = false;

[Survived] Boolean mutation
JsonParser.cs:23:29
         int arrayOffset = 0;
         int stringCounter = 0;
         bool isInsideString() => stringCounter % 2 == 1;
-        bool isEndOfValue = false;
+        bool isEndOfValue = true;
         bool isAdvancedNumber = false;
         for (int i = 0; i < json.Length; i++)

[Survived] Boolean mutation
JsonParser.cs:24:33
         int stringCounter = 0;
         bool isInsideString() => stringCounter % 2 == 1;
         bool isEndOfValue = false;
-        bool isAdvancedNumber = false;
+        bool isAdvancedNumber = true;
         for (int i = 0; i < json.Length; i++)
         {

[Killed] Equality mutation
JsonParser.cs:25:25
         bool isInsideString() => stringCounter % 2 == 1;
         bool isEndOfValue = false;
         bool isAdvancedNumber = false;
-        for (int i = 0; i < json.Length; i++)
+        for (int i = 0; i > json.Length; i++)
         {
             char currentChar = json[i];

[Killed] Equality mutation
JsonParser.cs:25:25
         bool isInsideString() => stringCounter % 2 == 1;
         bool isEndOfValue = false;
         bool isAdvancedNumber = false;
-        for (int i = 0; i < json.Length; i++)
+        for (int i = 0; i <= json.Length; i++)
         {
             char currentChar = json[i];

[Killed] Equality mutation
JsonParser.cs:28:33
         for (int i = 0; i < json.Length; i++)
         {
             char currentChar = json[i];
-            if (isEndOfValue && i != json.Length - 1)
+            if (isEndOfValue && i == json.Length - 1)
             {
                 if(currentChar == ',' && arrayOffset > 0)

[Killed] Negate expression
JsonParser.cs:28:17
         for (int i = 0; i < json.Length; i++)
         {
             char currentChar = json[i];
-            if (isEndOfValue && i != json.Length - 1)
+            if (!(isEndOfValue && i != json.Length - 1))
             {
                 if(currentChar == ',' && arrayOffset > 0)

[Killed] Block removal mutation
JsonParser.cs:29:13
         {
             char currentChar = json[i];
             if (isEndOfValue && i != json.Length - 1)
-            {
-                if(currentChar == ',' && arrayOffset > 0)
-                    continue;
-            }
+            {}
             if (currentChar == '"')
             {

[Killed] Equality mutation
JsonParser.cs:30:42
             char currentChar = json[i];
             if (isEndOfValue && i != json.Length - 1)
             {
-                if(currentChar == ',' && arrayOffset > 0)
+                if(currentChar == ',' && arrayOffset < 0)
                     continue;
             }

[Killed] Equality mutation
JsonParser.cs:30:20
             char currentChar = json[i];
             if (isEndOfValue && i != json.Length - 1)
             {
-                if(currentChar == ',' && arrayOffset > 0)
+                if(currentChar != ','  && arrayOffset > 0)
                     continue;
             }

[Killed] Statement mutation
JsonParser.cs:31:21
             if (isEndOfValue && i != json.Length - 1)
             {
                 if(currentChar == ',' && arrayOffset > 0)
-                    continue;
+                    ;
             }
             if (currentChar == '"')

[Killed] Equality mutation
JsonParser.cs:33:17
                 if(currentChar == ',' && arrayOffset > 0)
                     continue;
             }
-            if (currentChar == '"')
+            if (currentChar != '"')
             {
                 if (i == 0 || json[i - 1] != '\\')

[Killed] Block removal mutation
JsonParser.cs:34:13
                     continue;
             }
             if (currentChar == '"')
-            {
-                if (i == 0 || json[i - 1] != '\\')
-                    stringCounter++;
-
-                isEndOfValue = !isInsideString();
-            }
+            {}
             else if (isInsideString())
                 continue;

[Killed] Equality mutation
JsonParser.cs:35:31
             }
             if (currentChar == '"')
             {
-                if (i == 0 || json[i - 1] != '\\')
+                if (i == 0 || json[i - 1] == '\\')
                     stringCounter++;
 

[Killed] Arithmetic mutation
JsonParser.cs:35:36
             }
             if (currentChar == '"')
             {
-                if (i == 0 || json[i - 1] != '\\')
+                if (i == 0 || json[i + 1] != '\\')
                     stringCounter++;
 

[Killed] PostIncrementExpression to PostDecrementExpression mutation
JsonParser.cs:36:21
             if (currentChar == '"')
             {
                 if (i == 0 || json[i - 1] != '\\')
-                    stringCounter++;
+                                        stringCounter--;
 
                 isEndOfValue = !isInsideString();

[Killed] Statement mutation
JsonParser.cs:36:21
             if (currentChar == '"')
             {
                 if (i == 0 || json[i - 1] != '\\')
-                    stringCounter++;
+                    ;
 
                 isEndOfValue = !isInsideString();

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
JsonParser.cs:38:32
                 if (i == 0 || json[i - 1] != '\\')
                     stringCounter++;
 
-                isEndOfValue = !isInsideString();
+                isEndOfValue = isInsideString();
             }
             else if (isInsideString())

[Killed] Negate expression
JsonParser.cs:40:22
 
                 isEndOfValue = !isInsideString();
             }
-            else if (isInsideString())
+            else if (!(isInsideString()))
                 continue;
             else if (currentChar == '[')

[Survived] Statement mutation
JsonParser.cs:41:17
                 isEndOfValue = !isInsideString();
             }
             else if (isInsideString())
-                continue;
+                ;
             else if (currentChar == '[')
                 arrayOffset++;

[Killed] Equality mutation
JsonParser.cs:42:22
             }
             else if (isInsideString())
                 continue;
-            else if (currentChar == '[')
+            else if (currentChar != '[')
                 arrayOffset++;
             else if (currentChar == ']')

[Killed] Statement mutation
JsonParser.cs:43:17
             else if (isInsideString())
                 continue;
             else if (currentChar == '[')
-                arrayOffset++;
+                ;
             else if (currentChar == ']')
             {

[Killed] PostIncrementExpression to PostDecrementExpression mutation
JsonParser.cs:43:17
             else if (isInsideString())
                 continue;
             else if (currentChar == '[')
-                arrayOffset++;
+                                arrayOffset--;
             else if (currentChar == ']')
             {

[Killed] Equality mutation
JsonParser.cs:44:22
                 continue;
             else if (currentChar == '[')
                 arrayOffset++;
-            else if (currentChar == ']')
+            else if (currentChar != ']')
             {
                 if (arrayOffset <= 0)

[Killed] Block removal mutation
JsonParser.cs:45:13
             else if (currentChar == '[')
                 arrayOffset++;
             else if (currentChar == ']')
-            {
-                if (arrayOffset <= 0)
-                    return false;
-                
-                arrayOffset--;
-                isEndOfValue = true;
-            }
+            {}
             else if (currentChar == 'n' || currentChar == 't' || currentChar == 'f')
             {

[Killed] Negate expression
JsonParser.cs:46:21
                 arrayOffset++;
             else if (currentChar == ']')
             {
-                if (arrayOffset <= 0)
+                if (!(arrayOffset <= 0))
                     return false;
                 

[Killed] Equality mutation
JsonParser.cs:46:21
                 arrayOffset++;
             else if (currentChar == ']')
             {
-                if (arrayOffset <= 0)
+                if (arrayOffset < 0)
                     return false;
                 

[Killed] Boolean mutation
JsonParser.cs:47:28
             else if (currentChar == ']')
             {
                 if (arrayOffset <= 0)
-                    return false;
+                    return true;
                 
                 arrayOffset--;

[Killed] Statement mutation
JsonParser.cs:49:17
                 if (arrayOffset <= 0)
                     return false;
                 
-                arrayOffset--;
+                ;
                 isEndOfValue = true;
             }

[Killed] PostDecrementExpression to PostIncrementExpression mutation
JsonParser.cs:49:17
                 if (arrayOffset <= 0)
                     return false;
                 
-                arrayOffset--;
+                                
+                arrayOffset++;
                 isEndOfValue = true;
             }

[Killed] Boolean mutation
JsonParser.cs:50:32
                     return false;
                 
                 arrayOffset--;
-                isEndOfValue = true;
+                isEndOfValue = false;
             }
             else if (currentChar == 'n' || currentChar == 't' || currentChar == 'f')

[Killed] Logical mutation
JsonParser.cs:52:22
                 arrayOffset--;
                 isEndOfValue = true;
             }
-            else if (currentChar == 'n' || currentChar == 't' || currentChar == 'f')
+            else if (currentChar == 'n' || currentChar == 't' && currentChar == 'f')
             {
                 int remainingLength = (json.Length) - i;

[Killed] Logical mutation
JsonParser.cs:52:22
                 arrayOffset--;
                 isEndOfValue = true;
             }
-            else if (currentChar == 'n' || currentChar == 't' || currentChar == 'f')
+            else if (currentChar == 'n' && currentChar == 't'  || currentChar == 'f')
             {
                 int remainingLength = (json.Length) - i;

[Killed] Block removal mutation
JsonParser.cs:53:13
                 isEndOfValue = true;
             }
             else if (currentChar == 'n' || currentChar == 't' || currentChar == 'f')
-            {
-                int remainingLength = (json.Length) - i;
-                Range range = new Range(i, i + 4);
-
-                if (remainingLength < 4)
-                    return false;
-                else if (remainingLength >= 5 && json[new Range(i, i + 5)].SequenceEqual("false"))
-                    i += 4;
-                else if (json[range].SequenceEqual("true") || json[range].SequenceEqual("null"))
-                    i += 3;
-                else
-                    return false;
-
-                isEndOfValue = true;
-            }
+            {}
             else if (IsNumber(currentChar) || IsBasicMathChar(currentChar) || IsAdvancedMathChar(currentChar))
             {

[Survived] Arithmetic mutation
JsonParser.cs:54:39
             }
             else if (currentChar == 'n' || currentChar == 't' || currentChar == 'f')
             {
-                int remainingLength = (json.Length) - i;
+                int remainingLength = (json.Length) + i;
                 Range range = new Range(i, i + 4);
 

[Killed] Arithmetic mutation
JsonParser.cs:55:44
             else if (currentChar == 'n' || currentChar == 't' || currentChar == 'f')
             {
                 int remainingLength = (json.Length) - i;
-                Range range = new Range(i, i + 4);
+                Range range = new Range(i, i - 4);
 
                 if (remainingLength < 4)

[Killed] Equality mutation
JsonParser.cs:57:21
                 int remainingLength = (json.Length) - i;
                 Range range = new Range(i, i + 4);
 
-                if (remainingLength < 4)
+                if (remainingLength > 4)
                     return false;
                 else if (remainingLength >= 5 && json[new Range(i, i + 5)].SequenceEqual("false"))

[Killed] Negate expression
JsonParser.cs:57:21
                 int remainingLength = (json.Length) - i;
                 Range range = new Range(i, i + 4);
 
-                if (remainingLength < 4)
+                if (!(remainingLength < 4))
                     return false;
                 else if (remainingLength >= 5 && json[new Range(i, i + 5)].SequenceEqual("false"))

[Killed] Boolean mutation
JsonParser.cs:58:28
                 Range range = new Range(i, i + 4);
 
                 if (remainingLength < 4)
-                    return false;
+                    return true;
                 else if (remainingLength >= 5 && json[new Range(i, i + 5)].SequenceEqual("false"))
                     i += 4;

[Killed] Logical mutation
JsonParser.cs:59:26
 
                 if (remainingLength < 4)
                     return false;
-                else if (remainingLength >= 5 && json[new Range(i, i + 5)].SequenceEqual("false"))
+                else if (remainingLength >= 5 || json[new Range(i, i + 5)].SequenceEqual("false"))
                     i += 4;
                 else if (json[range].SequenceEqual("true") || json[range].SequenceEqual("null"))

[Killed] Arithmetic mutation
JsonParser.cs:59:68
 
                 if (remainingLength < 4)
                     return false;
-                else if (remainingLength >= 5 && json[new Range(i, i + 5)].SequenceEqual("false"))
+                else if (remainingLength >= 5 && json[new Range(i, i - 5)].SequenceEqual("false"))
                     i += 4;
                 else if (json[range].SequenceEqual("true") || json[range].SequenceEqual("null"))

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
JsonParser.cs:60:21
                 if (remainingLength < 4)
                     return false;
                 else if (remainingLength >= 5 && json[new Range(i, i + 5)].SequenceEqual("false"))
-                    i += 4;
+                                        i -=4;
                 else if (json[range].SequenceEqual("true") || json[range].SequenceEqual("null"))
                     i += 3;

[Killed] Logical mutation
JsonParser.cs:61:26
                     return false;
                 else if (remainingLength >= 5 && json[new Range(i, i + 5)].SequenceEqual("false"))
                     i += 4;
-                else if (json[range].SequenceEqual("true") || json[range].SequenceEqual("null"))
+                else if (json[range].SequenceEqual("true") && json[range].SequenceEqual("null"))
                     i += 3;
                 else

[Killed] Negate expression
JsonParser.cs:61:26
                     return false;
                 else if (remainingLength >= 5 && json[new Range(i, i + 5)].SequenceEqual("false"))
                     i += 4;
-                else if (json[range].SequenceEqual("true") || json[range].SequenceEqual("null"))
+                else if (!(json[range].SequenceEqual("true") || json[range].SequenceEqual("null")))
                     i += 3;
                 else

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
JsonParser.cs:62:21
                 else if (remainingLength >= 5 && json[new Range(i, i + 5)].SequenceEqual("false"))
                     i += 4;
                 else if (json[range].SequenceEqual("true") || json[range].SequenceEqual("null"))
-                    i += 3;
+                                        i -=3;
                 else
                     return false;

[Killed] Boolean mutation
JsonParser.cs:64:28
                 else if (json[range].SequenceEqual("true") || json[range].SequenceEqual("null"))
                     i += 3;
                 else
-                    return false;
+                    return true;
 
                 isEndOfValue = true;

[Killed] Boolean mutation
JsonParser.cs:66:32
                 else
                     return false;
 
-                isEndOfValue = true;
+                isEndOfValue = false;
             }
             else if (IsNumber(currentChar) || IsBasicMathChar(currentChar) || IsAdvancedMathChar(currentChar))

[Killed] Negate expression
JsonParser.cs:68:22
 
                 isEndOfValue = true;
             }
-            else if (IsNumber(currentChar) || IsBasicMathChar(currentChar) || IsAdvancedMathChar(currentChar))
+            else if (!(IsNumber(currentChar) || IsBasicMathChar(currentChar) || IsAdvancedMathChar(currentChar)))
             {
                 bool wasNumberBefore = i > 0 && (IsNumber(json[i - 1]));

[Killed] Logical mutation
JsonParser.cs:68:22
 
                 isEndOfValue = true;
             }
-            else if (IsNumber(currentChar) || IsBasicMathChar(currentChar) || IsAdvancedMathChar(currentChar))
+            else if (IsNumber(currentChar) || IsBasicMathChar(currentChar) && IsAdvancedMathChar(currentChar))
             {
                 bool wasNumberBefore = i > 0 && (IsNumber(json[i - 1]));

[Killed] Block removal mutation
JsonParser.cs:69:13
                 isEndOfValue = true;
             }
             else if (IsNumber(currentChar) || IsBasicMathChar(currentChar) || IsAdvancedMathChar(currentChar))
-            {
-                bool wasNumberBefore = i > 0 && (IsNumber(json[i - 1]));
-                if (IsAdvancedMathChar(currentChar) && !wasNumberBefore)
-                    return false;
-                if (IsAdvancedMathChar(currentChar))
-                {
-                    i++;
-                    isAdvancedNumber = true;
-                }
-                if (IsBasicMathChar(json[i]))
-                    i++;
-
-                bool numberAfterMathSign = false; 
-                while (i < json.Length && (IsNumber(json[i])))
-                {
-                    i++;
-                    numberAfterMathSign = true;
-                }
-                i--;
-
-                if (!numberAfterMathSign)
-                    return false;
-
-                isEndOfValue = true;
-            }
+            {}
             else
                 return false;

[Killed] Arithmetic mutation
JsonParser.cs:70:64
             }
             else if (IsNumber(currentChar) || IsBasicMathChar(currentChar) || IsAdvancedMathChar(currentChar))
             {
-                bool wasNumberBefore = i > 0 && (IsNumber(json[i - 1]));
+                bool wasNumberBefore = i > 0 && (IsNumber(json[i + 1]));
                 if (IsAdvancedMathChar(currentChar) && !wasNumberBefore)
                     return false;

[Killed] Logical mutation
JsonParser.cs:70:40
             }
             else if (IsNumber(currentChar) || IsBasicMathChar(currentChar) || IsAdvancedMathChar(currentChar))
             {
-                bool wasNumberBefore = i > 0 && (IsNumber(json[i - 1]));
+                bool wasNumberBefore = i > 0 || (IsNumber(json[i - 1]));
                 if (IsAdvancedMathChar(currentChar) && !wasNumberBefore)
                     return false;

[Killed] Negate expression
JsonParser.cs:71:21
             else if (IsNumber(currentChar) || IsBasicMathChar(currentChar) || IsAdvancedMathChar(currentChar))
             {
                 bool wasNumberBefore = i > 0 && (IsNumber(json[i - 1]));
-                if (IsAdvancedMathChar(currentChar) && !wasNumberBefore)
+                if (!(IsAdvancedMathChar(currentChar) && !wasNumberBefore))
                     return false;
                 if (IsAdvancedMathChar(currentChar))

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
JsonParser.cs:71:56
             else if (IsNumber(currentChar) || IsBasicMathChar(currentChar) || IsAdvancedMathChar(currentChar))
             {
                 bool wasNumberBefore = i > 0 && (IsNumber(json[i - 1]));
-                if (IsAdvancedMathChar(currentChar) && !wasNumberBefore)
+                if (IsAdvancedMathChar(currentChar) && wasNumberBefore)
                     return false;
                 if (IsAdvancedMathChar(currentChar))

[Killed] Boolean mutation
JsonParser.cs:72:28
             {
                 bool wasNumberBefore = i > 0 && (IsNumber(json[i - 1]));
                 if (IsAdvancedMathChar(currentChar) && !wasNumberBefore)
-                    return false;
+                    return true;
                 if (IsAdvancedMathChar(currentChar))
                 {

[Killed] Negate expression
JsonParser.cs:73:21
                 bool wasNumberBefore = i > 0 && (IsNumber(json[i - 1]));
                 if (IsAdvancedMathChar(currentChar) && !wasNumberBefore)
                     return false;
-                if (IsAdvancedMathChar(currentChar))
+                if (!(IsAdvancedMathChar(currentChar)))
                 {
                     i++;

[Killed] Block removal mutation
JsonParser.cs:74:17
                 if (IsAdvancedMathChar(currentChar) && !wasNumberBefore)
                     return false;
                 if (IsAdvancedMathChar(currentChar))
-                {
-                    i++;
-                    isAdvancedNumber = true;
-                }
+                {}
                 if (IsBasicMathChar(json[i]))
                     i++;

[Survived] Boolean mutation
JsonParser.cs:76:40
                 if (IsAdvancedMathChar(currentChar))
                 {
                     i++;
-                    isAdvancedNumber = true;
+                    isAdvancedNumber = false;
                 }
                 if (IsBasicMathChar(json[i]))

[Killed] Negate expression
JsonParser.cs:78:21
                     i++;
                     isAdvancedNumber = true;
                 }
-                if (IsBasicMathChar(json[i]))
+                if (!(IsBasicMathChar(json[i])))
                     i++;
 

[Killed] PostIncrementExpression to PostDecrementExpression mutation
JsonParser.cs:79:21
                     isAdvancedNumber = true;
                 }
                 if (IsBasicMathChar(json[i]))
-                    i++;
+                                        i--;
 
                 bool numberAfterMathSign = false; 

[Killed] Statement mutation
JsonParser.cs:79:21
                     isAdvancedNumber = true;
                 }
                 if (IsBasicMathChar(json[i]))
-                    i++;
+                    ;
 
                 bool numberAfterMathSign = false; 

[Killed] Boolean mutation
JsonParser.cs:81:44
                 if (IsBasicMathChar(json[i]))
                     i++;
 
-                bool numberAfterMathSign = false; 
+                bool numberAfterMathSign = true; 
                 while (i < json.Length && (IsNumber(json[i])))
                 {

[Killed] Negate expression
JsonParser.cs:82:24
                     i++;
 
                 bool numberAfterMathSign = false; 
-                while (i < json.Length && (IsNumber(json[i])))
+                while (!(i < json.Length && (IsNumber(json[i]))))
                 {
                     i++;

[Killed] Equality mutation
JsonParser.cs:82:24
                     i++;
 
                 bool numberAfterMathSign = false; 
-                while (i < json.Length && (IsNumber(json[i])))
+                while (i <= json.Length  && (IsNumber(json[i])))
                 {
                     i++;

[Timeout] Block removal mutation
JsonParser.cs:83:17
 
                 bool numberAfterMathSign = false; 
                 while (i < json.Length && (IsNumber(json[i])))
-                {
-                    i++;
-                    numberAfterMathSign = true;
-                }
+                {}
                 i--;
 

[Killed] Boolean mutation
JsonParser.cs:85:43
                 while (i < json.Length && (IsNumber(json[i])))
                 {
                     i++;
-                    numberAfterMathSign = true;
+                    numberAfterMathSign = false;
                 }
                 i--;

[Survived] PostDecrementExpression to PostIncrementExpression mutation
JsonParser.cs:87:17
                     i++;
                     numberAfterMathSign = true;
                 }
-                i--;
+                                i++;
 
                 if (!numberAfterMathSign)

[Survived] Statement mutation
JsonParser.cs:87:17
                     i++;
                     numberAfterMathSign = true;
                 }
-                i--;
+                ;
 
                 if (!numberAfterMathSign)

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
JsonParser.cs:89:21
                 }
                 i--;
 
-                if (!numberAfterMathSign)
+                if (numberAfterMathSign)
                     return false;
 

[Killed] Boolean mutation
JsonParser.cs:90:28
                 i--;
 
                 if (!numberAfterMathSign)
-                    return false;
+                    return true;
 
                 isEndOfValue = true;

[Killed] Equality mutation
JsonParser.cs:98:13
                 return false;
         }
 
-        if (arrayOffset != 0)
+        if (arrayOffset == 0)
             return false;
         else if (stringCounter % 2 == 1)

[Killed] Boolean mutation
JsonParser.cs:99:20
         }
 
         if (arrayOffset != 0)
-            return false;
+            return true;
         else if (stringCounter % 2 == 1)
             return false;

[Killed] Arithmetic mutation
JsonParser.cs:100:18
 
         if (arrayOffset != 0)
             return false;
-        else if (stringCounter % 2 == 1)
+        else if (stringCounter * 2  == 1)
             return false;
 

[Killed] Equality mutation
JsonParser.cs:100:18
 
         if (arrayOffset != 0)
             return false;
-        else if (stringCounter % 2 == 1)
+        else if (stringCounter % 2 != 1)
             return false;
 

[Killed] Boolean mutation
JsonParser.cs:101:20
         if (arrayOffset != 0)
             return false;
         else if (stringCounter % 2 == 1)
-            return false;
+            return true;
 
         return true;

[Killed] Block removal mutation
JsonParser.cs:107:5
     }
 
     private bool IsNumber(char currentChar)
-    {
-        switch(currentChar)
-        {
-            case '0':
-            case '1':
-            case '2':
-            case '3':
-            case '4':
-            case '5':
-            case '6':
-            case '7':
-            case '8':
-            case '9':
-                return true;
-            default:
-                return false;
-        }
-    }
+    {}
 
     private bool IsBasicMathChar(char currentChar)

[Killed] Boolean mutation
JsonParser.cs:120:24
             case '7':
             case '8':
             case '9':
-                return true;
+                return false;
             default:
                 return false;

[Killed] Equality mutation
JsonParser.cs:127:34
     }
 
     private bool IsBasicMathChar(char currentChar)
-        => currentChar == '-' || currentChar == '+';
+        => currentChar == '-' || currentChar != '+';
     private bool IsAdvancedMathChar(char currentChar)
     {

[Killed] Logical mutation
JsonParser.cs:127:12
     }
 
     private bool IsBasicMathChar(char currentChar)
-        => currentChar == '-' || currentChar == '+';
+        => currentChar == '-' && currentChar == '+';
     private bool IsAdvancedMathChar(char currentChar)
     {

[Killed] Block removal mutation
JsonParser.cs:129:5
     private bool IsBasicMathChar(char currentChar)
         => currentChar == '-' || currentChar == '+';
     private bool IsAdvancedMathChar(char currentChar)
-    {
-        switch (currentChar) 
-        {
-            case 'e':
-            case 'E':
-            case '.':
-                return true;
-            default:
-                return false;
-        }
-
-    }
+    {}
 
     public T Deserialize<T>(string json)

[Killed] Boolean mutation
JsonParser.cs:135:24
             case 'e':
             case 'E':
             case '.':
-                return true;
+                return false;
             default:
                 return false;

[NoCoverage] Block removal mutation
JsonParser.cs:143:5
     }
 
     public T Deserialize<T>(string json)
-    {
-        throw new NotImplementedException();
-    }
+    {}
 
     public string Serialize<T>(T data)

[Killed] String mutation
JsonParser.cs:150:21
     public string Serialize<T>(T data)
         => data switch
         {
-            null => "null",
+            null => "",
             string s => HandleString(s),
             IEnumerable array => HandleArray(array),

[Killed] Block removal mutation
JsonParser.cs:171:5
         };
 
     private string HandleComplexType<T>(T obj) where T : notnull
-    {
-        PropertyInfo[] props = obj.GetType().GetProperties();
-
-        if (!props.Any())
-            return "{}";
-
-        StringBuilder builder = new StringBuilder();
-        builder.Append('{');
-
-        foreach (PropertyInfo prop in props)
-        {
-            string value = Serialize(prop.GetValue(obj));
-            builder.Append($"\"{prop.Name}\":{value},");
-        }
-
-        builder.Remove(builder.Length - 1, 1);
-        builder.Append('}');
-        return builder.ToString();
-    }
+    {}
 
     private string HandleArray(IEnumerable list)
