[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
JsonParser.cs:174:13
     {
         PropertyInfo[] props = obj.GetType().GetProperties();
 
-        if (!props.Any())
+        if (props.Any())
             return "{}";
 

[Killed] Statement mutation
JsonParser.cs:178:9
             return "{}";
 
         StringBuilder builder = new StringBuilder();
-        builder.Append('{');
+        ;
 
         foreach (PropertyInfo prop in props)

[Killed] Block removal mutation
JsonParser.cs:181:9
         builder.Append('{');
 
         foreach (PropertyInfo prop in props)
-        {
-            string value = Serialize(prop.GetValue(obj));
-            builder.Append($"\"{prop.Name}\":{value},");
-        }
+        {}
 
         builder.Remove(builder.Length - 1, 1);

[Killed] Statement mutation
JsonParser.cs:183:13
         foreach (PropertyInfo prop in props)
         {
             string value = Serialize(prop.GetValue(obj));
-            builder.Append($"\"{prop.Name}\":{value},");
+            ;
         }
 

[Killed] String mutation
JsonParser.cs:183:28
         foreach (PropertyInfo prop in props)
         {
             string value = Serialize(prop.GetValue(obj));
-            builder.Append($"\"{prop.Name}\":{value},");
+            builder.Append($"");
         }
 

[Killed] Statement mutation
JsonParser.cs:186:9
             builder.Append($"\"{prop.Name}\":{value},");
         }
 
-        builder.Remove(builder.Length - 1, 1);
+        ;
         builder.Append('}');
         return builder.ToString();

[Killed] Arithmetic mutation
JsonParser.cs:186:24
             builder.Append($"\"{prop.Name}\":{value},");
         }
 
-        builder.Remove(builder.Length - 1, 1);
+        builder.Remove(builder.Length + 1, 1);
         builder.Append('}');
         return builder.ToString();

[Killed] Statement mutation
JsonParser.cs:187:9
         }
 
         builder.Remove(builder.Length - 1, 1);
-        builder.Append('}');
+        ;
         return builder.ToString();
     }

[Killed] Block removal mutation
JsonParser.cs:192:5
     }
 
     private string HandleArray(IEnumerable list)
-    {
-        if (!list.GetEnumerator().MoveNext())
-            return "[]";
-
-        StringBuilder builder = new StringBuilder();
-        builder.Append('[');
-       
-        foreach(var item in list)
-        {
-            string result = Serialize(item);
-            builder.Append($"{result},");
-        }
-
-        builder.Remove(builder.Length - 1, 1);
-        builder.Append(']');
-            
-        return builder.ToString();
-    }
+    {}
 
     private string HandleString(string str)

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
JsonParser.cs:193:13
 
     private string HandleArray(IEnumerable list)
     {
-        if (!list.GetEnumerator().MoveNext())
+        if (list.GetEnumerator().MoveNext())
             return "[]";
 

[Killed] String mutation
JsonParser.cs:194:20
     private string HandleArray(IEnumerable list)
     {
         if (!list.GetEnumerator().MoveNext())
-            return "[]";
+            return "";
 
         StringBuilder builder = new StringBuilder();

[Killed] Statement mutation
JsonParser.cs:197:9
             return "[]";
 
         StringBuilder builder = new StringBuilder();
-        builder.Append('[');
+        ;
        
         foreach(var item in list)

[Killed] Block removal mutation
JsonParser.cs:200:9
         builder.Append('[');
        
         foreach(var item in list)
-        {
-            string result = Serialize(item);
-            builder.Append($"{result},");
-        }
+        {}
 
         builder.Remove(builder.Length - 1, 1);

[Killed] Statement mutation
JsonParser.cs:202:13
         foreach(var item in list)
         {
             string result = Serialize(item);
-            builder.Append($"{result},");
+            ;
         }
 

[Killed] String mutation
JsonParser.cs:202:28
         foreach(var item in list)
         {
             string result = Serialize(item);
-            builder.Append($"{result},");
+            builder.Append($"");
         }
 

[Killed] Statement mutation
JsonParser.cs:206:9
         }
 
         builder.Remove(builder.Length - 1, 1);
-        builder.Append(']');
+        ;
             
         return builder.ToString();

[Killed] Block removal mutation
JsonParser.cs:212:5
     }
 
     private string HandleString(string str)
-    {
-        StringBuilder builder = new StringBuilder();
-        builder.Append('"');
-        foreach (char c in str)
-        {
-            if (c == '"')
-                builder.Append("\\\"");
-            else if (c == '\\')
-                builder.Append("\\\\");
-            else
-                builder.Append(c);
-        }
-        builder.Append('"');
-        return builder.ToString();
-    }
+    {}
 }

[Killed] Statement mutation
JsonParser.cs:214:9
     private string HandleString(string str)
     {
         StringBuilder builder = new StringBuilder();
-        builder.Append('"');
+        ;
         foreach (char c in str)
         {

[Killed] Block removal mutation
JsonParser.cs:216:9
         StringBuilder builder = new StringBuilder();
         builder.Append('"');
         foreach (char c in str)
-        {
-            if (c == '"')
-                builder.Append("\\\"");
-            else if (c == '\\')
-                builder.Append("\\\\");
-            else
-                builder.Append(c);
-        }
+        {}
         builder.Append('"');
         return builder.ToString();

[Killed] Equality mutation
JsonParser.cs:217:17
         builder.Append('"');
         foreach (char c in str)
         {
-            if (c == '"')
+            if (c != '"')
                 builder.Append("\\\"");
             else if (c == '\\')

[Killed] Statement mutation
JsonParser.cs:218:17
         foreach (char c in str)
         {
             if (c == '"')
-                builder.Append("\\\"");
+                ;
             else if (c == '\\')
                 builder.Append("\\\\");

[Killed] Equality mutation
JsonParser.cs:219:22
         {
             if (c == '"')
                 builder.Append("\\\"");
-            else if (c == '\\')
+            else if (c != '\\')
                 builder.Append("\\\\");
             else

[Killed] Statement mutation
JsonParser.cs:220:17
             if (c == '"')
                 builder.Append("\\\"");
             else if (c == '\\')
-                builder.Append("\\\\");
+                ;
             else
                 builder.Append(c);

[Killed] Statement mutation
JsonParser.cs:222:17
             else if (c == '\\')
                 builder.Append("\\\\");
             else
-                builder.Append(c);
+                ;
         }
         builder.Append('"');

[Killed] Statement mutation
JsonParser.cs:224:9
             else
                 builder.Append(c);
         }
-        builder.Append('"');
+        ;
         return builder.ToString();
     }
